; domain
( define ( domain eTipp ) ( :requirements :typing :action-costs ) ( :types size_t location_t side_t color_t image_t resource_t sheet_t ) ( :constants Letter - size_t Black Color - color_t Front Back - side_t Some_Feeder_Tray Some_Finisher_Tray Some_Purge_Tray fe1_Exit-hw1_LeftEntry hw1_RightExit-sys_Entry uc1_Entry-hw1_TopLeftExit lc1_Entry-hw1_BottomLeftExit hw1_TopRightEntry-uc1_Exit lc1_Exit-hw1_BottomRightEntry uc1_ExitToIME-uime_Entry uime_Exit-uc1_EntryFromIME lime_Entry-lc1_ExitToIME lc1_EntryFromIME-lime_Exit sys_OutputTray - location_t fe1-RSRC hw1-RSRC uc1-RSRC uime-RSRC lc1-RSRC lime-RSRC sys-RSRC - resource_t ) ( :predicates ( Sheetsize ?sheet - sheet_t ?size - size_t ) ( Location ?sheet - sheet_t ?location - location_t ) ( Hasimage ?sheet - sheet_t ?side - side_t ?image - image_t ) ( Sideup ?sheet - sheet_t ?side - side_t ) ( Stackedin ?sheet - sheet_t ?location - location_t ) ( Imagecolor ?image - image_t ?color - color_t ) ( Notprintedwith ?sheet - sheet_t ?side - side_t ?color - color_t ) ( Oppositeside ?side1 - side_t ?side2 - side_t ) ( Available ?resource - resource_t ) ( Prevsheet ?sheet1 - sheet_t ?sheet2 - sheet_t ) ( Uninitialized ) ) ( :functions ( total-cost ) - number ) ( :action initialize :parameters ( ) :precondition ( and ( Uninitialized ) ) :effect ( and ( Available fe1-RSRC ) ( Available hw1-RSRC ) ( Available uc1-RSRC ) ( Available uime-RSRC ) ( Available lc1-RSRC ) ( Available lime-RSRC ) ( Available sys-RSRC ) ) ) ( :action fe1-FeedMSI-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available fe1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet Some_Feeder_Tray ) ) :effect ( and ( Location ?sheet fe1_Exit-hw1_LeftEntry ) ( Sideup ?sheet Back ) ( Available fe1-RSRC ) ( increase ( total-cost ) 125 ) ) ) ( :action fe1-Feed-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available fe1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet Some_Feeder_Tray ) ) :effect ( and ( Location ?sheet fe1_Exit-hw1_LeftEntry ) ( Sideup ?sheet Back ) ( Available fe1-RSRC ) ( increase ( total-cost ) 224 ) ) ) ( :action hw1-LeftEntryToTopLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet fe1_Exit-hw1_LeftEntry ) ) :effect ( and ( Location ?sheet uc1_Entry-hw1_TopLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 1499 ) ) ) ( :action hw1-LeftEntryToBottomLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet fe1_Exit-hw1_LeftEntry ) ) :effect ( and ( Location ?sheet lc1_Entry-hw1_BottomLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 1499 ) ) ) ( :action hw1-TopRightEntryToTopLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet hw1_TopRightEntry-uc1_Exit ) ) :effect ( and ( Location ?sheet uc1_Entry-hw1_TopLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 8999 ) ) ) ( :action hw1-TopRightEntryToBottomLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet hw1_TopRightEntry-uc1_Exit ) ) :effect ( and ( Location ?sheet lc1_Entry-hw1_BottomLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 8999 ) ) ) ( :action hw1-BottomRightEntryToTopLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet lc1_Exit-hw1_BottomRightEntry ) ) :effect ( and ( Location ?sheet uc1_Entry-hw1_TopLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 8999 ) ) ) ( :action hw1-BottomRightEntryToBottomLeftExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet lc1_Exit-hw1_BottomRightEntry ) ) :effect ( and ( Location ?sheet lc1_Entry-hw1_BottomLeftExit ) ( Available hw1-RSRC ) ( increase ( total-cost ) 8999 ) ) ) ( :action hw1-TopRightEntryToRightExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet hw1_TopRightEntry-uc1_Exit ) ) :effect ( and ( Location ?sheet hw1_RightExit-sys_Entry ) ( Available hw1-RSRC ) ( increase ( total-cost ) 1499 ) ) ) ( :action hw1-BottomRightEntryToRightExit-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available hw1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet lc1_Exit-hw1_BottomRightEntry ) ) :effect ( and ( Location ?sheet hw1_RightExit-sys_Entry ) ( Available hw1-RSRC ) ( increase ( total-cost ) 1499 ) ) ) ( :action uc1-ToIME-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available uc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet uc1_Entry-hw1_TopLeftExit ) ) :effect ( and ( Location ?sheet uc1_ExitToIME-uime_Entry ) ( Available uc1-RSRC ) ( increase ( total-cost ) 2999 ) ) ) ( :action uc1-InvertToIME-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?otherface - side_t ) :precondition ( and ( Available uc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Oppositeside ?face ?otherface ) ( Location ?sheet uc1_Entry-hw1_TopLeftExit ) ( Sideup ?sheet ?face ) ) :effect ( and ( Location ?sheet uc1_ExitToIME-uime_Entry ) ( Sideup ?sheet ?otherface ) ( Available uc1-RSRC ) ( increase ( total-cost ) 8000 ) ) ) ( :action uc1-FromIME-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available uc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet uime_Exit-uc1_EntryFromIME ) ) :effect ( and ( Location ?sheet hw1_TopRightEntry-uc1_Exit ) ( Available uc1-RSRC ) ( increase ( total-cost ) 2999 ) ) ) ( :action uc1-InvertFromIME-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?otherface - side_t ) :precondition ( and ( Available uc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Oppositeside ?face ?otherface ) ( Location ?sheet uime_Exit-uc1_EntryFromIME ) ( Sideup ?sheet ?face ) ) :effect ( and ( Location ?sheet hw1_TopRightEntry-uc1_Exit ) ( Sideup ?sheet ?otherface ) ( Available uc1-RSRC ) ( increase ( total-cost ) 8000 ) ) ) ( :action uime-Simplex-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t ) :precondition ( and ( Available uime-RSRC ) ( Sheetsize ?sheet Letter ) ( Sideup ?sheet ?face ) ( Imagecolor ?image Black ) ( Location ?sheet uc1_ExitToIME-uime_Entry ) ( Notprintedwith ?sheet ?face Black ) ) :effect ( and ( Location ?sheet uime_Exit-uc1_EntryFromIME ) ( Hasimage ?sheet ?face ?image ) ( Available uime-RSRC ) ( increase ( total-cost ) 127790 ) ) ) ( :action lc1-ToIME-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available lc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet lc1_Entry-hw1_BottomLeftExit ) ) :effect ( and ( Location ?sheet lime_Entry-lc1_ExitToIME ) ( Available lc1-RSRC ) ( increase ( total-cost ) 4999 ) ) ) ( :action lc1-InvertToIME-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?otherface - side_t ) :precondition ( and ( Available lc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Oppositeside ?face ?otherface ) ( Location ?sheet lc1_Entry-hw1_BottomLeftExit ) ( Sideup ?sheet ?face ) ) :effect ( and ( Location ?sheet lime_Entry-lc1_ExitToIME ) ( Sideup ?sheet ?otherface ) ( Available lc1-RSRC ) ( increase ( total-cost ) 9999 ) ) ) ( :action lc1-FromIME-Letter :parameters ( ?sheet - sheet_t ) :precondition ( and ( Available lc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Location ?sheet lc1_EntryFromIME-lime_Exit ) ) :effect ( and ( Location ?sheet lc1_Exit-hw1_BottomRightEntry ) ( Available lc1-RSRC ) ( increase ( total-cost ) 4999 ) ) ) ( :action lc1-InvertFromIME-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?otherface - side_t ) :precondition ( and ( Available lc1-RSRC ) ( Sheetsize ?sheet Letter ) ( Oppositeside ?face ?otherface ) ( Location ?sheet lc1_EntryFromIME-lime_Exit ) ( Sideup ?sheet ?face ) ) :effect ( and ( Location ?sheet lc1_Exit-hw1_BottomRightEntry ) ( Sideup ?sheet ?otherface ) ( Available lc1-RSRC ) ( increase ( total-cost ) 9999 ) ) ) ( :action lime-Simplex-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t ) :precondition ( and ( Available lime-RSRC ) ( Sheetsize ?sheet Letter ) ( Sideup ?sheet ?face ) ( Imagecolor ?image Color ) ( Location ?sheet lime_Entry-lc1_ExitToIME ) ( Notprintedwith ?sheet ?face Color ) ) :effect ( and ( Location ?sheet lc1_EntryFromIME-lime_Exit ) ( Hasimage ?sheet ?face ?image ) ( Available lime-RSRC ) ( increase ( total-cost ) 212790 ) ) ) ( :action lime-SimplexMono-Letter :parameters ( ?sheet - sheet_t ?face - side_t ?image - image_t ) :precondition ( and ( Available lime-RSRC ) ( Sheetsize ?sheet Letter ) ( Sideup ?sheet ?face ) ( Imagecolor ?image Black ) ( Location ?sheet lime_Entry-lc1_ExitToIME ) ( Notprintedwith ?sheet ?face Black ) ) :effect ( and ( Location ?sheet lc1_EntryFromIME-lime_Exit ) ( Hasimage ?sheet ?face ?image ) ( Available lime-RSRC ) ( increase ( total-cost ) 212790 ) ) ) ( :action sys-Stack-Letter :parameters ( ?sheet - sheet_t ?prevsheet - sheet_t ) :precondition ( and ( Available sys-RSRC ) ( Prevsheet ?sheet ?prevsheet ) ( Location ?prevsheet Some_Finisher_Tray ) ( Sheetsize ?sheet Letter ) ( Location ?sheet hw1_RightExit-sys_Entry ) ) :effect ( and ( Location ?sheet Some_Finisher_Tray ) ( Stackedin ?sheet sys_OutputTray ) ( Available sys-RSRC ) ( increase ( total-cost ) 1499 ) ) ) )

; problem
(define (problem PrintJob)
(:domain eTipp)
(:objects
		dummy-sheet
		sheet1
		sheet2
		sheet3 - sheet_t
		image-1
		image-2
		image-3 - image_t
)
(:init
		(Uninitialized)
		(= (total-cost) 0)
		(Oppositeside Front Back)
		(Oppositeside Back Front)

                (Location dummy-sheet Some_Finisher_Tray)

                (Prevsheet sheet1 dummy-sheet)
		;; (Prevsheet sheet2 sheet1)
		;; (Prevsheet sheet3 sheet2)

                (Sheetsize sheet1 Letter)
		;; (Sheetsize sheet2 Letter)
		;; (Sheetsize sheet3 Letter)

                (Location sheet1 Some_Feeder_Tray)
		;; (Location sheet2 Some_Feeder_Tray)
		;; (Location sheet3 Some_Feeder_Tray)

                (Imagecolor image-1 Color)
		(Imagecolor image-2 Black)
		(Imagecolor image-3 Black)

		(Notprintedwith sheet1 Front Black)
		(Notprintedwith sheet1 Back Black)
		(Notprintedwith sheet1 Front Color)
		(Notprintedwith sheet1 Back Color)
		;; (Notprintedwith sheet2 Front Black)
		;; (Notprintedwith sheet2 Back Black)
		;; (Notprintedwith sheet2 Front Color)
		;; (Notprintedwith sheet2 Back Color)
		;; (Notprintedwith sheet3 Front Black)
		;; (Notprintedwith sheet3 Back Black)
		;; (Notprintedwith sheet3 Front Color)
		;; (Notprintedwith sheet3 Back Color)
)
(:goal (and
		(Hasimage sheet1 Front image-1)
		(Notprintedwith sheet1 Front Black)
		(Notprintedwith sheet1 Back Black)
		(Notprintedwith sheet1 Back Color)
		;; (Hasimage sheet2 Front image-2)
		;; (Notprintedwith sheet2 Front Color)
		;; (Notprintedwith sheet2 Back Black)
		;; (Notprintedwith sheet2 Back Color)
		;; (Hasimage sheet3 Front image-3)
		;; (Notprintedwith sheet3 Front Color)
		;; (Notprintedwith sheet3 Back Black)
		;; (Notprintedwith sheet3 Back Color)
		(Sideup sheet1 Front)
		;; (Sideup sheet2 Front)
		;; (Sideup sheet3 Front)
		(Stackedin sheet1 sys_OutputTray)
		;; (Stackedin sheet2 sys_OutputTray)
		;; (Stackedin sheet3 sys_OutputTray)
                )
)
(:metric minimize (total-cost))
)

; plan
1. (initialize)
   added: (available fe1-rsrc) (available hw1-rsrc) (available uc1-rsrc) (available uime-rsrc) (available lc1-rsrc) (available lime-rsrc) (available sys-rsrc)
   goals met: 3 of 6
2. (fe1-feed-letter sheet1)
   added: (location sheet1 fe1_exit-hw1_leftentry) (sideup sheet1 back)
   goals met: 3 of 6
3. (hw1-leftentrytobottomleftexit-letter sheet1)
   added: (location sheet1 lc1_entry-hw1_bottomleftexit)
   goals met: 3 of 6
4. (lc1-inverttoime-letter sheet1 back front)
   added: (location sheet1 lime_entry-lc1_exittoime) (sideup sheet1 front)
   goals met: 4 of 6
5. (lime-simplex-letter sheet1 front image-1)
   added: (location sheet1 lc1_entryfromime-lime_exit) (hasimage sheet1 front image-1)
   goals met: 5 of 6
6. (lc1-fromime-letter sheet1)
   added: (location sheet1 lc1_exit-hw1_bottomrightentry)
   goals met: 5 of 6
7. (hw1-bottomrightentrytorightexit-letter sheet1)
   added: (location sheet1 hw1_rightexit-sys_entry)
   goals met: 5 of 6
8. (sys-stack-letter sheet1 dummy-sheet)
   added: (location sheet1 some_finisher_tray) (stackedin sheet1 sys_outputtray)
   goals met: 6 of 6
